IDEA StatiCa Open Model
PrestressInputType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of input of prestressing
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum PrestressInputType
Public Enumeration PrestressInputType
public enum class PrestressInputType
Members
Member name | Value | Description
AfterTransfer | 1 |  stress after transfer - long term losses will be calculated
AfterLongTermLosses | 3 |  stress after long term losses is added to tendon
See Also
Reference
IdeaRS.OpenModel.Concrete.Load Namespace